# This file contains large contents for seedind

@seeds_contents = {}
@seeds_contents[:content_demo_page] = <<-EOT
<h1>Страница проверки контента</h1>
<p>Цель этого HTML в том, чтобы помочь определить, какие параметры по умолчанию с помощью CSS и чтобы убедиться, что все возможные элементы HTML, включены в этот HTML таким образом, чтобы не пропустить ни возможных элементов при проектировании сайта.</p>
<h1>Параграф и заголовки</h1>
<p><img style="width:250px;height:125px;float:right" src="http://lorempixel.com/250/125" alt="CSS | God's Language" /> Далеко-далеко за <a href="#" title="test link">словесными горами</a> в стране гласных и согласных живут рыбные тексты. Вдали от всех живут они в буквенных домах на берегу Семантика большого языкового океана. Маленький ручеек Даль журчит по всей стране и обеспечивает ее всеми необходимыми правилами. Эта парадигматическая страна, в которой жаренные члены предложения залетают прямо в рот. Даже всемогущая пунктуация не имеет власти над рыбными текстами, ведущими безорфографичный образ жизни. Однажды одна маленькая строчка рыбного текста по имени Lorem ipsum решила выйти в большой мир грамматики.</p>
<p>Далеко-далеко за <em>словесными горами</em> в стране гласных и согласных живут рыбные тексты. Вдали от всех живут они в буквенных домах на берегу <strong>Семантика</strong> большого языкового океана. Маленький ручеек Даль журчит по всей стране и обеспечивает ее всеми необходимыми правилами. Эта парадигматическая страна, в которой жаренные члены предложения залетают прямо в рот. Даже всемогущая пунктуация не имеет власти над рыбными текстами, ведущими безорфографичный образ жизни. Однажды одна маленькая строчка рыбного текста по имени Lorem ipsum решила выйти в большой мир грамматики.</p>
<h2>Заголовок 2</h2>
<p>Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. Вдали от всех живут они в буквенных домах на берегу Семантика большого языкового океана. Маленький ручеек Даль журчит по всей стране и обеспечивает ее всеми необходимыми правилами. Эта парадигматическая страна, в которой жаренные члены предложения залетают прямо в рот. Даже всемогущая пунктуация не имеет власти над рыбными текстами, ведущими безорфографичный образ жизни. Однажды одна маленькая строчка рыбного текста по имени Lorem ipsum решила выйти в большой мир грамматики.</p>
<h3>Заголовок 3</h3>
<p>Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. Вдали от всех живут они в буквенных домах на берегу Семантика большого языкового океана. Маленький ручеек Даль журчит по всей стране и обеспечивает ее всеми необходимыми правилами. Эта парадигматическая страна, в которой жаренные члены предложения залетают прямо в рот. Даже всемогущая пунктуация не имеет власти над рыбными текстами, ведущими безорфографичный образ жизни. Однажды одна маленькая строчка рыбного текста по имени Lorem ipsum решила выйти в большой мир грамматики.</p>
<h4>Заголовок 4</h4>
<p>Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. Вдали от всех живут они в буквенных домах на берегу Семантика большого языкового океана. Маленький ручеек Даль журчит по всей стране и обеспечивает ее всеми необходимыми правилами. Эта парадигматическая страна, в которой жаренные члены предложения залетают прямо в рот. Даже всемогущая пунктуация не имеет власти над рыбными текстами, ведущими безорфографичный образ жизни. Однажды одна маленькая строчка рыбного текста по имени Lorem ipsum решила выйти в большой мир грамматики.</p>
<h5>Заголовок 5</h5>
<p>Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. Вдали от всех живут они в буквенных домах на берегу Семантика большого языкового океана. Маленький ручеек Даль журчит по всей стране и обеспечивает ее всеми необходимыми правилами. Эта парадигматическая страна, в которой жаренные члены предложения залетают прямо в рот. Даже всемогущая пунктуация не имеет власти над рыбными текстами, ведущими безорфографичный образ жизни. Однажды одна маленькая строчка рыбного текста по имени Lorem ipsum решила выйти в большой мир грамматики.</p>
<h6>Заголовок 6</h6>
<p>Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. Вдали от всех живут они в буквенных домах на берегу Семантика большого языкового океана. Маленький ручеек Даль журчит по всей стране и обеспечивает ее всеми необходимыми правилами. Эта парадигматическая страна, в которой жаренные члены предложения залетают прямо в рот. Даже всемогущая пунктуация не имеет власти над рыбными текстами, ведущими безорфографичный образ жизни. Однажды одна маленькая строчка рыбного текста по имени Lorem ipsum решила выйти в большой мир грамматики.</p>
<h1>Типы списков</h1>
<h3>Список определений</h3>
<dl>
  <dt>Заголовок списка определений</dt>
  <dd>Это определение разделение списке.</dd>
</dl>
<h3>Нумерованный список</h3>
<ol>
  <li>Элемент списка 1</li>
  <li>Элемент списка 2</li>
  <li>
    Элемент списка с подсписком
    <ol>
      <li>Элемент подсписка 1</li>
      <li>Элемент подсписка 2</li>
    </ol>
  </li>
  <li>Элемент списка 3</li>
</ol>
<h3>Неупорядоченный список</h3>
<ul>
  <li>Элемент списка 1</li>
  <li>
    Элемент списка с подсписком
    <ul>
      <li>Элемент подсписка 1</li>
      <li>Элемент подсписка 2</li>
    </ul>
  </li>
  <li>Элемент списка 2</li>
  <li>Элемент списка 3</li>
</ul>
<h1>Таблицы</h1>
<table>
  <thead>
    <tr><th>Заголовок таблицы 1</th><th>Заголовок таблицы 2</th><th>Заголовок таблицы 3</th></tr>
  </thead>
  <tbody>
    <tr><td>Отдел 1</td><td>Отдел 2</td><td>Отдел 3</td></tr>
    <tr><td>Отдел 1</td><td>Отдел 2</td><td>Отдел 3</td></tr>
    <tr><td>Отдел 1</td><td>Отдел 2</td><td>Отдел 3</td></tr>
  </tbody>
</table>
<h1>Всякая всячина - abbr, pre, code, sub, sup, etc.</h1>
<p>Далеко-далеко за <sup>словесными горами</sup> в стране <sub>гласных и согласных</sub> живут рыбные тексты. <cite>вот так</cite>. Вдали от всех живут они в буквенных домах на берегу Семантика большого языкового океана. Маленький ручеек Даль журчит по всей стране и обеспечивает ее всеми необходимыми правилами. Эта парадигматическая страна, в которой жаренные члены предложения залетают прямо в рот. Даже всемогущая <abbr title="National Basketball Association">НБА</abbr> не имеет власти над рыбными текстами, ведущими безорфографичный образ жизни. Однажды одна маленькая строчка рыбного текста по имени Lorem ipsum решила выйти в большой мир грамматики.</p>
<pre><code>
  scope :visibles, -> { where(hided: false) }
  scope :ordered, -> { order(prior: :asc, id: :asc) }
  scope :without_ids, ->(idsarr) { where.not(id: idsarr) }

  def home?
    path.blank? && (!new_record? || self.class.count == 0)
  end

</code></pre>
<blockquote>
  "Эта таблица стилей невероятно поможет." <br /><small>Цитатко</small>
</blockquote>
EOT

